Revit 2027 API
ReferencePoint.GetCoordinateSystem Method
The position and orientation of the ReferencePoint.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetCoordinateSystem()
Public Function GetCoordinateSystem As Transform
public:
Transform^ GetCoordinateSystem()
member GetCoordinateSystem : unit -> Transform
Return Value
Transform
Remarks
The position of the point is given by CoordinateSystem.Origin, and the orientation is specified by the three unit vectors CoordinateSystem.BasisX, BasisY, BasisZ.
See Also
Reference
ReferencePoint Class
Autodesk.Revit.DB Namespace